P = dlmread('matrixDistr.dat');
M = size(P,1);

% M = 4;
% B = [0.35 0.169 0.00481 0.47619; 0.57 0.2408 0.0473 0.1419; 
% 0.14 0.6622 0.06923 0.12857;
% 0.56 0.4048 0.014432 0.020768 ];
% P = B;

% нахождение стационарных вероятностей
% транспонирование матрицы
B = P;
P = P';
% вычитание 1 из диагональных элементов
for i = 1:M
    P(i,i) = P(i,i) - 1;
end
% заменяем последнюю строчку единицами (сумма всех вероятностей = 1)
P(M,:) = ones(1,M);
% находим обратную матрицу
P = inv(P);
% получаем вероятности
Pr = P(:, M);

dlmwrite('Probabilities.txt',Pr);

H1 = 0;
h1 = zeros(1, M);
for i = 1:M
    for j = 1: M
        if(B(i,j) ~= 0) 
            h1(j) = h1(j) + log2(B(i,j))*B(i,j);
        end
    end
    H1 = H1 + h1(i)*Pr(i);
end

H1 = H1 *(-1);
H1